#Basic Level
  1. Retrieve the names of employees who earn more than the average salary of all employees.
   

```
SELECT name
FROM employee
WHERE salary > (
    SELECT AVG(salary)
    FROM employee
);

```
2. Find the employees who belong to the department with the highest average salary.


```
SELECT name
FROM employee
WHERE department_id = (
    SELECT department_id
    FROM employee
    GROUP BY department_id
    HAVING AVG(salary) = (
        SELECT MAX(avg_salary)
        FROM (
            SELECT AVG(salary) AS avg_salary
            FROM employee
            GROUP BY department_id
        ) t
    )
);

```
3. List all employees who have made at least one sale.


```
SELECT name
FROM employee
WHERE emp_id IN (
    SELECT DISTINCT emp_id
    FROM sales
);

```
4. Find the employee with the highest sale amount.


```
SELECT name
FROM employee
WHERE emp_id = (
    SELECT emp_id
    FROM sales
    WHERE amount = (
        SELECT MAX(amount)
        FROM sales
    )
);

```
5. Retrieve the names of employees whose salaries are higher than Shubham’s salary.


```
SELECT name
FROM employee
WHERE salary > (
    SELECT MAX(salary)
    FROM employee
    WHERE name = 'Shubham'
);

```
#Intermediate Level

1.Find employees who work in the same department as Abhishek.

```
SELECT name
FROM employee
WHERE department_id = (
    SELECT department_id
    FROM employee
    WHERE name = 'Abhishek'
);

```
2. List departments that have at least one employee earning more than ₹60,000.


```
SELECT dept_name
FROM department
WHERE dept_id IN (
    SELECT department_id
    FROM employee
    WHERE salary > 60000
);

```
3.Find the department name of the employee who made the highest sale.


```
SELECT dept_name
FROM department
WHERE dept_id IN (
    SELECT department_id
    FROM employee
    WHERE emp_id IN (
        SELECT emp_id
        FROM sales
        WHERE amount = (
            SELECT MAX(amount)
            FROM sales
        )
    )
);

```
4. Retrieve employees who have made sales greater than the average sale amount.


```
SELECT name
FROM employee e
WHERE EXISTS (
    SELECT 1
    FROM sales s
    WHERE s.emp_id = e.emp_id
      AND s.amount > (
          SELECT AVG(amount)
          FROM sales
      )
);

```
5.Find the total sales made by employees who earn more than the average salary.

```
SELECT SUM(amount) AS total_sales
FROM sales
WHERE emp_id IN (
    SELECT emp_id
    FROM employee
    WHERE salary > (
        SELECT AVG(salary)
        FROM employee
    )
);

```
#Advanced Level
1. Find employees who have not made any sales.


```
SELECT name
FROM employee
WHERE emp_id NOT IN (
    SELECT DISTINCT emp_id
    FROM sales
);

```
2.List departments where the average salary is above ₹55,000.


```
SELECT dept_name
FROM department
WHERE dept_id IN (
    SELECT department_id
    FROM employee
    GROUP BY department_id
    HAVING AVG(salary) > 55000
);

```
3.Retrieve department names where the total sales exceed ₹10,000.


```
SELECT dept_name
FROM department
WHERE dept_id IN (
    SELECT department_id
    FROM employee
    WHERE emp_id IN (
        SELECT emp_id
        FROM sales
        GROUP BY emp_id
        HAVING SUM(amount) > 10000
    )
);

```
4.Find the employee who has made the second-highest sale.



```
SELECT name, sale_amount
FROM (
    SELECT
        e.name,
        s.sale_amount,
        DENSE_RANK() OVER (ORDER BY s.sale_amount DESC) as sale_rank
    FROM Employee e
    JOIN Sales s ON e.emp_id = s.emp_id
) ranked_sales
WHERE sale_rank = 2;
```

5.Retrieve the names of employees whose salary is greater than the highest sale amount recorded.

```
SELECT name
FROM Employee
WHERE salary > (SELECT MAX(sale_amount) FROM Sales);
```